; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	infrared3 - mode
	thermograph0 - mode
	image2 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star6 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star6)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Phenomenon7)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared3)
	(have_image Planet10 image1)
	(have_image Planet11 image2)
))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 7
4. (turn_to satellite1 phenomenon9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 7
5. (take_image satellite1 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 2 of 7
6. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 7
7. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
10. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 3 of 7
11. (turn_to satellite0 planet11 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet11)
   goals met: 3 of 7
12. (take_image satellite0 planet11 instrument0 image2)
   added: (have_image planet11 image2)
   goals met: 4 of 7
13. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 4 of 7
14. (take_image satellite0 planet8 instrument0 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 5 of 7
15. (turn_to satellite1 planet10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet10)
   goals met: 5 of 7
16. (take_image satellite1 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 6 of 7
17. (turn_to satellite3 phenomenon7 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon7)
   goals met: 7 of 7
